[
  {
    "title": "Paint Associate",
    "employmentType": "Part-time",
    "company": "The Home Depot",
    "location": "North Bergen, New Jersey, United States · On-site",
    "startDate": "Jul 2023",
    "endDate": "Oct 2023",
    "description": "As a Paint Associate at The Home Depot, I was responsible for assisting customers in selecting the right paint products and supplies for their projects. My duties included:\n1. Providing Expert Advice: Offering knowledgeable guidance to customers on paint selection, color matching, and application techniques based on their specific needs and preferences.\n2. Mixing and Matching Paint: Utilizing precision paint mixing equipment to create custom paint colors and finishes according to customer specifications.\n3. Product Recommendations: Recommending additional paint-related products, such as brushes, rollers, primers, and sealants, to enhance the quality and longevity of the paint job.\n4. Customer Service: Delivering exceptional customer service by addressing inquiries, resolving concerns, and ensuring a positive shopping experience for every customer.\n5. Order Fulfillment: Assisting customers with placing special orders for paint products that may require custom color matching or specific quantities.\n6. Inventory Management: Monitoring paint inventory levels, restocking shelves, and organizing displays to ensure products are readily available for customers.\n7. Product Knowledge: Staying informed about new paint products, trends, and technologies to provide customers with up-to-date information and recommendations.\n8. Safety Compliance: Adhering to safety protocols and procedures when handling paint products, including proper storage, handling, and disposal practices.\nOverall, my role as a Paint Associate involved providing personalized service, expert advice, and support to customers to help them achieve successful paint projects and home improvement goals."
  },
  {
    "title": "Cashier",
    "employmentType": "Part-time",
    "company": "Superfood market",
    "location": "",
    "startDate": "Feb 2023",
    "endDate": "Apr 2023",
    "description": ""
  },
  {
    "title": "Retail Cashier",
    "employmentType": "Part-time",
    "company": "Sam's Club",
    "location": "Secaucus, New Jersey, United States · On-site",
    "startDate": "Dec 2021",
    "endDate": "Sep 2022",
    "description": ""
  },
  {
    "title": "Lifeguard",
    "employmentType": "Seasonal",
    "company": "Borough Of Ridgefield",
    "location": "Ridgefield, New Jersey, United States · On-site",
    "startDate": "May 2019",
    "endDate": "Sep 2019",
    "description": ""
  }
]
